app/controllers/public_controller.rb

  def homepage
    @users = Usuario.all
---
SELECT "usuarios".* FROM "usuarios"

  def admin
    @restaurantes = Restaurante.all.sort_by {|obj| obj.nombre}
    if params == {"controller"=>"public", "action"=>"admin"}
    else
      if admin_params.nil?
      else
        admin_params.each do |id, valor|
          if valor == "3"
            puts id
            puts id.class
            Restaurante.delete(id)
            puts id
          else
            rest = Restaurante.find(Integer(id))
            rest.update(estado: valor)
---
SELECT "restaurantes".* FROM "restaurantes"
DELETE FROM "restaurantes" WHERE "restaurantes"."id" = $1  [["id", nil]]
SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 47], ["LIMIT", 1]]
UPDATE "restaurantes" SET "estado" = $1, "updated_at" = $2 WHERE "restaurantes"."id" = $3  [["estado", 2], ["updated_at", "2019-12-05 20:01:16.149564"], ["id", 47]]

  def info_rest
    @restaurante = Restaurante.where(id: params[:id])[0]
---
SELECT "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1  [["id", 49]]

  def login_user
      if params[:tipo]== "0"
        usuario = Usuario.where(nombre: params[:datos][:nombre], password: params[:datos][:password])
        # El elemento 0 es el objeto usuario en cuestion
        if usuario[0].nil?
          redirect_to "/login"
        else
          if usuario[0].tipo == 1
            redirect_to "/admin"
          else
            redirect_to :controller => "usuarios", :action => "dashboard", :data => usuario[0].id
          end
        end
      else
        restaurante = Restaurante.where(nombre: params[:datos][:nombre], password: params[:datos][:password])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."nombre" = $1 AND "usuarios"."password" = $2  [["nombre", "Tomas"], ["password", "12345"]]
SELECT "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."nombre" = $1 AND "restaurantes"."password" = $2  [["nombre", "Tomas"], ["password", "12345"]]

  def signup

    if params == {"controller"=>"public", "action"=>"signup"}
    else
      if params[:tipo]== "0"
        data = user_params.dup
        data['tipo'] = 0
        usuario = Usuario.new(data)
        usuario.save
      else
        # Pendiente = 1
        # Aceptado = 0
        # Rechazado = 2

        data = user_params.dup
        data['estado'] = 1
        restaurante = Restaurante.new(data)
        restaurante.save
---
INSERT INTO "usuarios" ("tipo", "nombre", "correo", "direccion", "created_at", "updated_at", "password", "telefono") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "restaurantes" ("nombre", "correo", "direccion", "telefono", "created_at", "updated_at", "password", "estado") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def dashboard
    @restaurantes = Restaurante.all
---
SELECT "restaurantes".* FROM "restaurantes"