app/controllers/public_controller.rb

SELECT "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."estado" = $1  [["estado", 0]]
---
  def stats #INCOMPLETO
    @count_rest = 0
    @pedidos_por_rest = {}
    @ingresos_por_restaurante = {}

    Restaurante.where(estado: 0).each do |rest|

SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
SELECT "platos".* FROM "platos" WHERE "platos"."restaurante_id" = $1  [["restaurante_id", 45]]
---
  def view_restaurant
    @restaurante = Restaurante.find(params[:id])
    @platos = Plato.where(restaurante_id: @restaurante.id)