app/controllers/restaurantes_controller.rb

SELECT "comentario_platos".* FROM "comentario_platos"
---
  def cargar_datos
    @platos = Plato.where(restaurante_id: @restaurante.id)

    @ordenes = []
    @comentarios_platos = []
    @platos.each do |plato|

      ContienePlato.all.each do |contiene_plato|
        if contiene_plato.plato_id == plato.id
          @ordens += Orden.where(id: contiene_plato.orden_id)
        end
      end

      ComentarioPlato.all.each do |comentario_plato|

INSERT INTO "platos" ("nombre", "precio", "descripcion", "porciones", "image", "restaurante_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def crear_plato
    @restaurante = Restaurante.find(params[:id])
    if params[:datos].nil? == true # GET Method (if no data)
    else                           # POST Method
      plato = Plato.new(params_crear_plato)
      plato.restaurante_id = @restaurante.id.dup
      plato.save