app/controllers/restaurantes_controller.rb

  def cargar_datos
    @platos = Plato.where(restaurante_id: @restaurante.id)

    @ordenes = []
    @comentarios_platos = []
    @platos.each do |plato|

      ContienePlato.all.each do |contiene_plato|
        if contiene_plato.plato_id == plato.id

          @ordens += Orden.where(id: contiene_plato.orden_id)
        end
      end

      ComentarioPlato.all.each do |comentario_plato|
---
SELECT "ordens".* FROM "ordens" WHERE "ordens"."id" = $1  [["id", 2]]
SELECT "contiene_platos".* FROM "contiene_platos"
SELECT "comentario_platos".* FROM "comentario_platos"

  def crear_plato
    @msg = ''
    @restaurante = Restaurante.find(params[:id])
    if params[:datos].nil? == true # GET Method (if no data)
    else                           # POST Method
      @msg = "Plato creado!"
      plato = Plato.new(params_crear_plato)
      plato.restaurante_id = @restaurante.id.dup
      plato.save
---
INSERT INTO "platos" ("nombre", "descripcion", "image", "restaurante_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nombre", ""], ["descripcion", ""], ["image", ""], ["restaurante_id", 46], ["created_at", "2019-12-06 13:35:03.582611"], ["updated_at", "2019-12-06 13:35:03.582611"]]

  def eliminar_plato
    puts params
    id = params[:id_plato]
    puts id
    Plato.delete(id)
---
DELETE FROM "platos" WHERE "platos"."id" = $1  [["id", nil]]