app/controllers/restaurantes_controller.rb

SELECT "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1  [["id", 45]]
---
  def dashboard
    @restaurante = Restaurante.where(id: params[:id])[0]

SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
UPDATE "restaurantes" SET "updated_at" = $1 WHERE "restaurantes"."id" = $2  [["updated_at", "2019-12-09 20:13:16.282940"], ["id", 53]]
---
  def cambiar_img_rest
    @restaurante = Restaurante.find(params[:id])
    image = params.require(:restaurante).permit(:avatar)
    @restaurante.update(image)

SELECT  "platos".* FROM "platos" WHERE "platos"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "platos" SET "updated_at" = $1 WHERE "platos"."id" = $2  [["updated_at", "2019-12-09 20:41:33.673376"], ["id", 16]]
SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
---
  def cambiar_img_plato
    @plato = Plato.find(params[:id])
    image = params.require(:plato).permit(:picture)
    @plato.update(image)
    @restaurante = Restaurante.find(params[:id_rest])

SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]
SELECT "ordens".* FROM "ordens" WHERE "ordens"."id" = $1  [["id", 2]]
SELECT "contiene_platos".* FROM "contiene_platos" WHERE "contiene_platos"."orden_id" = $1  [["orden_id", 4]]
SELECT "platos".* FROM "platos" WHERE "platos"."restaurante_id" = $1  [["restaurante_id", 45]]
SELECT "contiene_platos".* FROM "contiene_platos"
UPDATE "ordens" SET "estado" = $1, "updated_at" = $2 WHERE "ordens"."id" = $3  [["estado", true], ["updated_at", "2019-12-09 14:14:05.215412"], ["id", 6]]
DELETE FROM "ordens" WHERE "ordens"."id" = $1  [["id", 5]]
DELETE FROM "platos" WHERE "platos"."id" = $1  [["id", 6]]
---
  def orden
    @restaurante = Restaurante.find(params[:id])
    @orden = Orden.find(params[:id_orden])

    @contiene_platos = ContienePlato.where(orden_id: @orden.id)
    @platos = []
    @contiene_platos.each do |cont_plato|
      if cont_plato.cantidad != 0 and cont_plato.cantidad != "0"
        print 'heey'
        print cont_plato.cantidad
        print 'heey x2'
        @platos.push([Plato.find(cont_plato.plato_id), cont_plato.cantidad])
      end
    end

    if params[:respuesta].nil? == false
      respuesta = params[:respuesta]

      if respuesta == "Aceptar orden"
        @orden.estado = true
        @orden.save
      else
        @orden.delete()

SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 46], ["LIMIT", 1]]
UPDATE "restaurantes" SET "nombre" = $1, "correo" = $2, "direccion" = $3, "telefono" = $4, "password" = $5, "updated_at" = $6 WHERE "restaurantes"."id" = $7  [["nombre", "McDonalds"], ["correo", "macdo@mc.cl"], ["direccion", "La Dehesa"], ["telefono", "800-MACDO-000"], ["password", "12345"], ["updated_at", "2019-12-06 13:23:55.368877"], ["id", 45]]
---
  def perfil
    @success = false
    @restaurante = Restaurante.find(params[:id])
    if params[:datos].nil? == false

      update_data = params_update_perfil.dup
      update_data.each do |key, value|
        if value == '' or value == ' '
          update_data.delete(key)
        end
      end

      @restaurante.update(update_data)

SELECT "platos".* FROM "platos" WHERE "platos"."restaurante_id" = $1  [["restaurante_id", 53]]
SELECT "contiene_platos".* FROM "contiene_platos"
SELECT  "platos".* FROM "platos" WHERE "platos"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "ordens".* FROM "ordens" WHERE "ordens"."id" = $1  [["id", 2]]
---
  def cargar_datos
    @platos = Plato.where(restaurante_id: @restaurante.id)

    @ordenes = []
    @comentarios_platos = []
    @platos.each do |plato|

      ContienePlato.all.each do |contiene_plato|
        if contiene_plato.plato_id == plato.id
          @ordenes += Orden.where(id: contiene_plato.orden_id)

SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
INSERT INTO "platos" ("restaurante_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["restaurante_id", 53], ["created_at", "2019-12-09 19:51:44.451069"], ["updated_at", "2019-12-09 19:51:44.451069"]]
---
  def crear_plato
    @plato = Plato.new()
    @msg = ''
    @restaurante = Restaurante.find(params[:id])
    if params[:datos].nil? == true # GET Method (if no data)
    else                           # POST Method
      @msg = "Plato creado!"
      @plato.update(params_crear_plato)
      @plato.restaurante_id = @restaurante.id.dup
      @plato.save

DELETE FROM "platos" WHERE "platos"."id" = $1  [["id", 5]]
---
  def eliminar_plato
    puts params
    id = params[:id_plato]
    puts id
    Plato.delete(id)

SELECT  "platos".* FROM "platos" WHERE "platos"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
---
  def detalles_plato
    @id_rest = params[:id_rest]
    @plato = Plato.find(params[:id])
    @restaurante = Restaurante.find(@id_rest)