app/controllers/usuarios_controller.rb

  def dashboard
    @usuario = Usuario.where(id: params[:data])[0]
    @restaurantes = Restaurante.where(estado: 0)
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1  [["id", 37]]
SELECT "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."estado" = $1  [["estado", 0]]

  def perfil
    @success = false
    @usuario = Usuario.find(params[:data])
    @restaurantes = Restaurante.where(estado: 0)

    rest_fav_table = RestFav.where(usuario_id: @usuario.id)[0]

    if rest_fav_table.nil? == false
      @restaurante_fav = Restaurante.find(rest_fav_table.restaurante_id)
    end

    if params[:datos].nil? == false

      update_data = params_update_perfil.dup
      update_data.each do |key, value|
        if value == '' or value == ' '
          update_data.delete(key)
        end
      end

      fav_id = params[:fav]

      if fav_id != 'nil'

        if rest_fav_table.nil? == false
          RestFav.delete(rest_fav_table.id)
        end
        RestFav.create(usuario_id: @usuario.id, restaurante_id: fav_id)
        redirect_back(fallback_location: "/userdashboard/#{@usuario.id}/perfil")

      end
      @usuario.update(update_data)
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]
SELECT "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."estado" = $1  [["estado", 0]]
SELECT "rest_favs".* FROM "rest_favs" WHERE "rest_favs"."usuario_id" = $1  [["usuario_id", "45"]]
SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
DELETE FROM "rest_favs" WHERE "rest_favs"."id" = $1  [["id", 6]]
INSERT INTO "rest_favs" ("usuario_id", "restaurante_id") VALUES ($1, $2) RETURNING "id"  [["usuario_id", "45"], ["restaurante_id", "53"]]
UPDATE "usuarios" SET "nombre" = $1, "correo" = $2, "direccion" = $3, "telefono" = $4, "password" = $5, "updated_at" = $6 WHERE "usuarios"."id" = $7  [["nombre", "Cristian"], ["correo", "juan@mc.cl"], ["direccion", "San Joaquin"], ["telefono", "800-MACDO-000"], ["password", "54321"], ["updated_at", "2019-12-06 14:42:51.131392"], ["id", 41]]

  def view_restaurant
    @restaurante = Restaurante.find(params[:id])
    @usuario = Usuario.find(params[:data])
    @platos = Plato.where(restaurante_id: @restaurante.id)
    @comentarios_rest = ComentarioRestaurante.where(restaurante_id: @restaurante.id)

    if params[:del_id].nil? == false
      coment = ComentarioRestaurante.find(params[:del_id])
      coment.delete()
    end

    if params[:comentario].nil? == false
      ComentarioRestaurante.create(params_comentario)
    end

    @puntaje = "N/A"
    if @comentarios_rest.nil? == false
      count = 0
      puntaje_acumulado = 0

      @comentarios_rest.each do |comentario|
---
SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]
SELECT "platos".* FROM "platos" WHERE "platos"."restaurante_id" = $1  [["restaurante_id", 53]]
SELECT "comentario_restaurantes".* FROM "comentario_restaurantes" WHERE "comentario_restaurantes"."restaurante_id" = $1  [["restaurante_id", 53]]
SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "comentario_restaurantes".* FROM "comentario_restaurantes" WHERE "comentario_restaurantes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "comentario_restaurantes" WHERE "comentario_restaurantes"."id" = $1  [["id", nil]]
INSERT INTO "comentario_restaurantes" ("usuario_id", "restaurante_id", "fecha", "puntaje", "contenido") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["usuario_id", 45], ["restaurante_id", 53], ["fecha", "2019-12-07 23:36:47"], ["puntaje", 4.0], ["contenido", "Hola, segundo comentario"]]

  def self.get_user_from_id(id)
    Usuario.find(id)
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]

  def ordenes
    id = params[:data]
    @id = id
    @ordenes_pasadas = Orden.where(usuario_id: id, estado: true)
---
SELECT "ordens".* FROM "ordens" WHERE "ordens"."usuario_id" = $1 AND "ordens"."estado" = $2  [["usuario_id", 45], ["estado", true]]

  def self.find_rest_by_order_id(orden_id)
    plato_id = ContienePlato.where(orden_id: orden_id)[0].plato_id
    Restaurante.find(Plato.find(plato_id).restaurante_id)
---
SELECT "contiene_platos".* FROM "contiene_platos" WHERE "contiene_platos"."orden_id" = $1  [["orden_id", 2]]
SELECT  "platos".* FROM "platos" WHERE "platos"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]

  def pedido
    @usuario = Usuario.find(params[:data])
    @restaurante = Restaurante.find(params[:id])
    @platos = Plato.where(restaurante_id: @restaurante.id)

    if params[:datos].nil? == false
      @orden = Orden.new(usuario_id: @usuario.id, estado: 0)
      @orden.update(params_pedido)
      @orden.save

      params[:datos].each do |id_plate, quant|
        if quant != 0
          contiene_plato = ContienePlato.create(orden_id: @orden.id, plato_id: id_plate, cantidad: quant)
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]
SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
SELECT "platos".* FROM "platos" WHERE "platos"."restaurante_id" = $1  [["restaurante_id", 45]]
INSERT INTO "ordens" ("medio_pago", "direccion_entrega", "estado", "notas", "usuario_id", "created_at", "updated_at", "precio") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "contiene_platos" ("orden_id", "plato_id", "cantidad") VALUES ($1, $2, $3)  [["orden_id", 4], ["plato_id", 5], ["cantidad", 1]]

  def detalle_orden
    @usuario = Usuario.find(params[:data])
    @orden = Orden.find(params[:orden_id])

    @contiene_platos = ContienePlato.where(orden_id: @orden.id)
    @restaurante = Restaurante.find(Plato.find(@contiene_platos[0].plato_id).restaurante_id)
    @platos = []
    @contiene_platos.each do |cont_plato|
      @platos.push([Plato.find(cont_plato.plato_id), cont_plato.cantidad])
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]
SELECT  "ordens".* FROM "ordens" WHERE "ordens"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "contiene_platos".* FROM "contiene_platos" WHERE "contiene_platos"."orden_id" = $1  [["orden_id", 3]]
SELECT  "platos".* FROM "platos" WHERE "platos"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
SELECT "contiene_platos".* FROM "contiene_platos" WHERE "contiene_platos"."orden_id" = $1  [["orden_id", 2]]

  def confirmacion_pedido
    @usuario = Usuario.find(params[:data])
    @restaurante = Restaurante.find(params[:id])
    @platos = Plato.where(restaurante_id: @restaurante.id)

    @datos = params[:datos]
    datos2 = @datos.dup
    @total = 0

    datos2.each do |key, value|
      if value == 0
        @datos.delete(key)
      end
    end

    @datos.each do |key, value|
      puts @total
      @total += (value.to_i * Plato.where(id: key)[0].precio.to_i)
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]
SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
SELECT "platos".* FROM "platos" WHERE "platos"."restaurante_id" = $1  [["restaurante_id", 45]]
SELECT "platos".* FROM "platos" WHERE "platos"."id" = $1  [["id", 5]]