app/controllers/usuarios_controller.rb

  def cambiar_img
    @usuario = Usuario.find(params[:data])
    image = params.require(:usuario).permit(:image)
    @usuario.update(image)
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]
UPDATE "usuarios" SET "updated_at" = $1 WHERE "usuarios"."id" = $2  [["updated_at", "2019-12-09 18:52:55.022049"], ["id", 45]]