app/controllers/usuarios_controller.rb

  def perfil
    @success = false
    @usuario = Usuario.find(params[:data])
    @restaurantes = Restaurante.where(estado: 0)

    rest_fav_table = RestFav.where(usuario_id: @usuario.id)[0]
    @restaurante_fav = Restaurante.find(rest_fav_table.restaurante_id)

    if params[:datos].nil? == false

      update_data = params_update_perfil.dup
      update_data.each do |key, value|
        if value == '' or value == ' '
          update_data.delete(key)
        end
      end

      fav_id = params[:fav]

      if fav_id != 'nil'

        RestFav.delete(rest_fav_table.id)
        RestFav.create(usuario_id: @usuario.id, restaurante_id: fav_id)
        redirect_back(fallback_location: "/userdashboard/#{@usuario.id}/perfil")

      end
      @usuario.update(update_data)
---
UPDATE "usuarios" SET "telefono" = $1, "updated_at" = $2 WHERE "usuarios"."id" = $3  [["telefono", "...."], ["updated_at", "2019-12-06 17:21:39.452117"], ["id", 43]]

  def pedido
    @usuario = Usuario.find(params[:data])
    @restaurante = Restaurante.find(params[:id])
    @platos = Plato.where(restaurante_id: @restaurante.id)

    if params[:datos].nil? == false
      @orden = Orden.new(usuario_id: @usuario.id, estado: 1)
      @orden.update(params_pedido)
      puts @orden.medio_pago

      params[:datos].each do |id_plate, quant|
        contiene_plato = ContienePlato.create(orden_id: @orden.id, plato_id: id_plate, cantidad: quant)
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]
INSERT INTO "ordens" ("medio_pago", "direccion_entrega", "estado", "notas", "usuario_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "contiene_platos" ("orden_id", "plato_id", "cantidad") VALUES ($1, $2, $3)  [["orden_id", 1], ["plato_id", 1], ["cantidad", 1]]

  def confirmacion_pedido
    @usuario = Usuario.find(params[:data])
    @restaurante = Restaurante.find(params[:id])
    @platos = Plato.where(restaurante_id: @restaurante.id)
---
SELECT "platos".* FROM "platos" WHERE "platos"."restaurante_id" = $1  [["restaurante_id", 53]]